//=========================================================
//SBinCode
//二进制代码读取类
//
//编写：方寸
//
//
//日期：2013-8-15
//=========================================================

#ifndef _S_BINCODE_
#define	_S_BINCODE_

#include <stdio.h>
#include "SString.h"

class SBinCode
{
	//Data
private:
	FILE *m_fp;
	SString m_str;
	//Function
public:
	//=========================================================
	//函数：SBinCode
	//说明：构造函数
	//输入：
	//输出：
	//返回：
	//日期：2013-8-15
	//备注：
	//=========================================================
	SBinCode()
	{
		m_fp=NULL;
	}
	//=========================================================
	//函数：~SBinCode
	//说明：解析函数
	//输入：
	//输出：
	//返回：
	//日期：2013-8-15
	//备注：
	//=========================================================
	~SBinCode()
	{
		if(m_fp)
			fclose(m_fp);
	}
	//=========================================================
	//函数：OpenFile
	//说明：打开一个文件
	//输入：
	//输出：
	//返回：true：打开成功，false：打开失败
	//日期：2013-8-14
	//备注：
	//=========================================================
	bool OpenFile(const char *strFile)
	{
		if(m_fp)
			fclose(m_fp);
		m_fp=fopen(strFile,"rb");
		
		if(!m_fp)
			return false;
		return true;
	}
	//=========================================================
	//函数：Close
	//说明：关闭打开的文件
	//输入：
	//输出：
	//返回：
	//日期：2013-8-15
	//备注：
	//=========================================================
	void Close()
	{
		if(m_fp)
			fclose(m_fp);
		m_fp=NULL;
	}
	//=========================================================
	//函数：ReadInt
	//说明：读取一个整型数
	//输入：
	//输出：
	//返回：
	//日期：2013-8-15
	//备注：
	//=========================================================
	int ReadInt()
	{
		int nNum;

		fread(&nNum,sizeof(nNum),1,m_fp);

		return nNum;
	}
	//=========================================================
	//函数：ReadString
	//说明：读取一个字符串
	//输入：
	//输出：
	//返回：
	//日期：2013-8-15
	//备注：
	//=========================================================
	SString &ReadString()
	{
		SString str;
		char ReadChar;

		m_str="";
		ReadChar=fgetc(m_fp);
		while(ReadChar!='\0')
		{
			m_str+=ReadChar;
			ReadChar=fgetc(m_fp);
		}

		return m_str;
	}
	//=========================================================
	//函数：Seek
	//说明：指针跳转
	//输入：nPos：要跳到的代码位置
	//输出：
	//返回：
	//日期：2013-8-15
	//备注：
	//=========================================================
	void Seek(int nPos)
	{
		fseek(m_fp,nPos,SEEK_SET);
	}
};

#endif
